_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 1, 47, 256)        206080    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 23, 256)        196864    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 11, 256)        196864    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 5, 256)         196864    
_________________________________________________________________
global_average_pooling2d_1 ( (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 168)               43176     
_________________________________________________________________
dense_2 (Dense)              (None, 168)               28392     
=================================================================
Total params: 868,240
Trainable params: 868,240
Non-trainable params: 0
_________________________________________________________________
Epoch 1/20
